//=============================================================================
//                                     Задача 14
// Напишите программу, которая принимает на вход число и проверяет, 
// кратно ли оно одновременно 7 и 23
//=============================================================================


Console.Clear();
Console.WriteLine(
    "Программа принимает на вход число и проверяет,кратно ли оно одновременно 7 и 23.\n"
);

int number;
bool checkDivision;

ReadData();
CalculateData();
PrintData();

// Считывает число от пользователя
void ReadData () {
    Console.Write("Введите число: ");
    number = int.Parse( Console.ReadLine() ?? "");
}

// Вычисляет кратность на 7 и 23
void CalculateData(){
    checkDivision = (number % 7 == 0) && (number % 23 == 0);
}

//Выводит результат в консоль
void PrintData(){
    Console.WriteLine(
        checkDivision 
        ? $"Число {number} кратно 7 и 23 одновременно"
        : $"Число {number}  не кратно 7 и 23 одновременно"
    );
}
